loadApiExt({
    "definitions": {
        "analyticData": {
            "description": "This model represents analytic data in System."
        },
        "backendUser": {
            "description": "This model represents an Administrator Account Level 2 in System. At level 2, account owner have most rights in System except managing other same level accounts. System owner provides Administrator Account Level 2 to people who is responsible for managing all system data and account of users are using service provided by System owner."
        },
        "businessCategory": {
            "description": "This model represents a Business Category in System."
        },
        "business": {
            "description": "This model represents a Business in System."
        },
        "businessPaymentTransaction": {
            "description": "This model represents a payment transaction made by a Business."
        },
        "fileInfo": {
            "description": "This model represents a file that is being managed by System. It contains all information about a file like: name, location, type.... Whenever Developers uploaded a file into System, a relevant fileInfo model will be automatically created."
        },
        "frontendUser": {
            "description": "This model represents an account belongs to a user who is using service provided by System owner. That account can be created by using Signup function on mobile or web application."
        },
        "pushNotificationEmail": {
            "description": "This model represents an Email or a Push Notification that was sent by an Adminstrator account or user (frontendUser) account."
        },
        "Role": {
            "description": "This model represents a role of Administrator account in System. There are some default roles: <br/>- SystemAdministrator role is the highest privilege role in System. With this role, an Administrator can manage other Administrator Account Level 1.<br/>- An Administrator's account granted BackendUserManager role can manage all Administrator Account Level 2.<br/>- An Administrator's account granted BackendDataManager role can manage data like: Listing, Category...<br/>- An Administrator's account granted BackendDataViewer role can view data but cannot manipulate.<br/>- An Administrator's account granted FrontendUserManager role can manage all users (frontendUser) who is using service provided by System owner."
        },
        "rootUser": {
            "description": "This model represents an Administrator Account Level 1 in System and has the higest privileges. By using that account, an Administrator can manage all Administrator Account Level 2."
        },
        "storage": {
            "description": "This model represents a Storage on Server that is used to store all files uploaded. Storage stores file in seperate containers (It's real folders on Server machine if system does not use third-party storage provider). When uploading a file, mobile or web application must specify name of container in request URL. There are 2 default container are 'avatar' and 'listing'. 'avatar' container stores avatar images of every accounts in System and 'listing' container stores images of every Listing."
        }
    }
});